# Data Science with `R` Practice

This practice will be going over the fundamentals of data science with `R`. Much of the content will be similar to your lab, [Introduction to Data Science with R](../labs/intro_data_science_r.ipynb), and thus it will serve as a good guide post to answering some of the questions. We'll begin today with reading in the data...

## Read in the Data

In [1]:
df <- read.csv('/dsa/data/all_datasets/baby-names/NationalNames2.csv')

head(df)

  Id Name      Year Gender Count
1  4 Elizabeth 1880 F      1939
2  8 Alice     1880 F      1414
3 12 Clara     1880 F      1226
4 13 Ella      1880 F      1156
5 18 Nellie    1880 F       995
6 21 Maude     1880 F       858

Now that the data is read in, how would you remove the `Id` column from the dataframe in `R`. Remember, `R` is very flexible so there are several ways to remove columns. Do the following:

**Activity 1**: Remove the column `Id` from the dataframe and rename this data frame, `df`.

**Activity 2**: Find the dimensions (the number of rows and columns) of this updated data frame. *Hint: You will have to look up the function to do this as it was not mentioned in the lab*. 

**Activity 3**: Display the ***last*** 10 columns of the updated data frame.

In [2]:
#' Code for Activity 1 goes here -----------------------
df <- subset(df, select = -Id)
#head(df)

In [3]:
#' Code for Activity 2 goes here -----------------------
#nrow(df)
#ncol(df)
#length(df)
dim(df)

[1] 608892      4

In [4]:
#' Code for Activity 3 goes here -----------------------
tail(df, 10)

       Name     Year Gender Count
608883 Zaymere  2014 M      5
608884 Zekeriah 2014 M      5
608885 Zenas    2014 M      5
608886 Ziion    2014 M      5
608887 Zijun    2014 M      5
608888 Zirui    2014 M      5
608889 Zo       2014 M      5
608890 Zyel     2014 M      5
608891 Zyran    2014 M      5
608892 Zyrin    2014 M      5

Below is one of the ways that you can subset a data frame. Run the code below to see what it returns.

In [5]:
head(df[df$Count > 2000,])

    Name    Year Gender Count
330 Charles 1880 M      5348
331 Thomas  1880 M      2534
985 James   1881 M      5442
986 Frank   1881 M      2834
987 Thomas  1881 M      2282
988 Robert  1881 M      2140

The bit of code only returns the first few rows of data but, in reality, there are lot more rows.

**Activity 4**: *Find out how many rows where the `Count` is greater than 2000.*

In [6]:
#' Code for Activity 4 goes here -----------------------
nrow(df[df$Count > 2000,])

[1] 10092

Now let's say that we were interested in only male names, particularly those names that are popular and not so popular.

**Activity 5**: subset the data set for rows where the gender is male and the count is above 2000 and below 100.

In [7]:
#' Code for Activity 5 goes here -----------------------
male <- subset(df, Gender == 'M')
maleSubset <- subset(male, Count > 2000 | Count < 100)
head(maleSubset, 10)

    Name    Year Gender Count
330 Charles 1880 M      5348
331 Thomas  1880 M      2534
367 Gus     1880 M        99
368 Jake    1880 M        96
369 Adolph  1880 M        93
370 Felix   1880 M        92
371 Wallace 1880 M        91
372 Claud   1880 M        90
373 Roscoe  1880 M        90
374 Hiram   1880 M        88

Imagine we were interested in names during a certain time period and we didn't need any of the data for the years were were not interested in. Let's say we were interested in names from the year 1950 through 1965. Below is one way to subset based on a specific year.

In [8]:
df1950 <- head(df[df$Year == 1950,])
df1965 <- head(df[df$Year == 1965,])

comb <- rbind(df1950,df1965)

head(comb);tail(comb)

       Name    Year Gender Count
153876 Mary    1950 F      65460
153877 Nancy   1950 F      29621
153878 Deborah 1950 F      29071
153879 Sandra  1950 F      28893
153880 Karen   1950 F      24139
153881 Pamela  1950 F      16200

       Name     Year Gender Count
211248 Patricia 1965 F      23554
211249 Linda    1965 F      19339
211250 Michelle 1965 F      16215
211251 Lori     1965 F      15698
211252 Teresa   1965 F      14578
211253 Barbara  1965 F      14026

**Questions**
1. What does the `rbind` function do?
2. Describe what the code above is doing.

Answer the questions above here.
1. rbind adds two data frames vertically with the same datatypes



2. the code is subsetting the data into datasets in 1950 and 1965
   then combining the two subset dataframes vertically
   then printing the first six and last six rows of the combined dataframes

Well, the above code would be extremely inefficient when trying to find all of the names between the years 1950 and 1965. How might you subset the data frame based off names between the year 1950 through 1965 without subsetting each year seperately. 

**Activity 6**: *Subset the data frame based off names between the year 1950 through 1965 without subsetting each year seperately.*

In [9]:
#' Code for Activity 6 goes here -----------------------
FiftyToSixtyFive <- df[(df$Year <=1965 & df$Year>=1950),]
#head(FiftyToSixtyFive)
tail(FiftyToSixtyFive)

       Name   Year Gender Count
215204 Tylon  1965 M      5
215205 Tyre   1965 M      5
215206 Vahe   1965 M      5
215207 Vyron  1965 M      5
215208 Wadell 1965 M      5
215209 Wane   1965 M      5

## A Bit of Sorting

The code below sorts the data frame based of `Count`, but we can also sort the data alphabetically off of a column of strings.

In [10]:
head(df[order(df$Count),])

    Name      Year Gender Count
295 Adrienne  1880 F      5
296 Albertine 1880 F      5
297 Alys      1880 F      5
298 Celie     1880 F      5
299 Cordella  1880 F      5
300 Corrine   1880 F      5

**Activity 7**: Sort the data frame based on `Name` where the names starting with "Z" are on the top of the frame.

In [26]:
#' Code for Activity 7 goes here -----------------------
df[order(df$Name, decreasing = TRUE), ]

       Name      Year Gender Count
563987 Zzyzx     2010 M       5
552813 Zyvion    2009 M       5
506575 Zytavious 2005 M       5
573751 Zytaveon  2011 M       8
462463 Zyshonne  2001 M      12
506574 Zyshon    2005 M       5
474082 Zyshawn   2002 M       6
517885 Zyshawn   2006 M       5
527366 Zyshawn   2007 M      11
562174 Zyshawn   2010 M       9
575378 Zyshawn   2011 M       5
595272 Zyshawn   2013 M      13
608260 Zyshawn   2014 M       6
453744 Zyshaun   2000 M       6
485215 Zysean    2003 M       5
596318 Zyrus     2013 M       8
444494 Zyron     1999 M       5
452295 Zyron     2000 M      12
539454 Zyron     2008 M       9
562442 Zyron     2010 M       8
584193 Zyron     2012 M      12
494402 Zyrion    2004 M       8
527546 Zyrion    2007 M      10
539737 Zyrion    2008 M       8
552141 Zyrion    2009 M       6
572878 Zyrion    2011 M      12
586607 Zyrin     2012 M       5
608892 Zyrin     2014 M       5
523136 Zyrihanna 2007 F       7
545449 Zyrihanna 2009 F       9
⋮      ⋮         ⋮    ⋮      ⋮
596018 Aadhavan  2013 M        8
505517 Aadhav    2005 M        6
574153 Aadhav    2011 M        6
505937 Aadesh    2005 M        5
536542 Aaden     2008 M      956
546964 Aaden     2009 F        5
570784 Aaden     2011 M      274
604455 Aaden     2014 M      236
472731 Aadarsh   2002 M       10
573752 Aadarsh   2011 M        7
595273 Aadarsh   2013 M       12
605821 Aadarsh   2014 M       18
561606 Aadan     2010 M       11
584194 Aadan     2012 M       11
348496 Aadam     1988 M        5
416231 Aadam     1996 M        5
483124 Aadam     2003 M       10
493937 Aadam     2004 M        9
515933 Aadam     2006 M        9
540142 Aadam     2008 M        6
562443 Aadam     2010 M        7
605755 Aadam     2014 M       19
535466 Aabriella 2008 F        5
603336 Aabriella 2014 F        5
484591 Aabid     2003 M        5
551649 Aaban     2009 M        6
561955 Aaban     2010 M        9
572879 Aaban     2011 M       11
595040 Aaban     2013 M       14
605960 Aaban     2014 M       16

## Manipulating data with dplyr

`dplyr` makes manipulating data a bit simpler. Take a look at the code below.

In [12]:
library(dplyr)
df %>%
    filter(Name == "Linda") %>%
    arrange(-Count) %>%
    head()

  Name  Year Gender Count
1 Linda 1952 F      67096
2 Linda 1953 F      61244
3 Linda 1946 F      52708
4 Linda 1955 F      51275
5 Linda 1957 F      44496
6 Linda 1945 F      41465

**Questions**
1. Describe what the code above is doing.

Answer the question above here.
1. The code is loading the dplyr library
   then creating a dataframe fed by the filter of Names equaling Linda
   that feeds into arranging the datafram of Lindas by descending Count
   that feeds into printing the top 6 Lindas in the dataframe

There is a lot more that you can do with `dplyr` such as renaming column names, lets try some.

**Activity 8**: *Copy the code above, but rename each of the columns so that the headers begin with lowercase letters. Name this data frame 'df_lower`.*

**Activity 9**: *Now, on the `df_lower` frame, remove the `gender` column.*

In [13]:
#' Code for Activity 8 goes here -----------------------
library(dplyr)

df_lower <-
df %>%
    filter(Name == "Linda") %>%
    arrange(-Count) %>%
    rename(name = Name, year = Year, gender = Gender, count = Count )
#head(df_lower)

In [14]:
#' Code for Activity 9 goes here -----------------------
noGender <- subset(df_lower, select = -gender)
head(noGender)

  name  year count
1 Linda 1952 67096
2 Linda 1953 61244
3 Linda 1946 52708
4 Linda 1955 51275
5 Linda 1957 44496
6 Linda 1945 41465

**Activity 10**: *Using `dplyr`, select rows based on both the names "Linda" and "John".*

In [15]:
#' Code for Activity 10 goes here -----------------------
filter(df, Name == "Linda" | Name == "John" )
#sorted <- arrange(df,desc(Name))

    Name  Year Gender Count
1   Linda 1880 F        27
2   Linda 1883 F        49
3   John  1883 M      8894
4   John  1884 F        40
5   Linda 1885 F        60
6   John  1885 M      8756
7   John  1888 M      9248
8   John  1889 M      8548
9   Linda 1890 F        54
10  Linda 1892 F        83
11  Linda 1893 F        83
12  John  1893 F        61
13  John  1893 M      8049
14  John  1895 M      8321
15  Linda 1897 F        81
16  John  1897 F        46
17  John  1898 F        55
18  John  1898 M      8159
19  Linda 1900 F       126
20  John  1900 F        46
21  Linda 1902 F        91
22  John  1903 F        41
23  John  1903 M      7608
24  John  1905 F        43
25  John  1906 F        43
26  John  1907 F        65
27  John  1908 F        58
28  John  1908 M      9342
29  John  1909 F        67
30  John  1911 F        68
⋮   ⋮     ⋮    ⋮      ⋮
131 Linda 1987 M         15
132 Linda 1988 M          9
133 Linda 1989 F       1843
134 John  1989 M      29836
135 Linda 1989 M         17
136 John  1990 F         81
137 John  1990 M      29067
138 Linda 1991 F       1608
139 John  1992 F         56
140 Linda 1993 F       1486
141 John  1994 F         48
142 Linda 1994 M         11
143 John  1995 F         45
144 Linda 1996 F        985
145 John  1997 M      21369
146 John  1999 M      20338
147 Linda 2001 F        837
148 John  2002 F         21
149 John  2002 M      17437
150 John  2004 F         71
151 John  2004 M      16436
152 Linda 2005 F        745
153 John  2005 F         37
154 Linda 2006 F        698
155 John  2008 F         21
156 Linda 2009 F        548
157 John  2009 M      12100
158 Linda 2012 F        448
159 John  2013 F         16
160 John  2014 F         14

**Challenge Activity 1**: *Use `dplyr` to find the max Count per year per name (both Linda and John).*

In [16]:
#' Code for Challenge Activity 1 goes here -----------------------
df %>%
filter(Name == "Linda") %>%
arrange(-Count) %>%
head(1)


df %>%
filter(Name == "John") %>%
arrange(-Count) %>%
head(1)

  Name  Year Gender Count
1 Linda 1952 F      67096

  Name Year Gender Count
1 John 1947 M      88318

# Save your notebook, then `File > Close and Halt`